log-slash-home-with-optimization.log
Phase started: Warm up (index: 0, duration: 100s) 11:42:56(+0530)

--------------------------------------
Metrics for period to: 11:43:00(+0530) (width: 3.602s)
--------------------------------------

http.codes.200: ................................................................ 106
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 113
http.response_time:
  min: ......................................................................... 89
  max: ......................................................................... 583
  median: ...................................................................... 198.4
  p95: ......................................................................... 273.2
  p99: ......................................................................... 550.1
http.responses: ................................................................ 106
vusers.completed: .............................................................. 106
vusers.created: ................................................................ 113
vusers.created_by_name.0: ...................................................... 113
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 96.3
  max: ......................................................................... 597.8
  median: ...................................................................... 214.9
  p95: ......................................................................... 301.9
  p99: ......................................................................... 561.2


--------------------------------------
Metrics for period to: 11:43:10(+0530) (width: 9.857s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 272
  median: ...................................................................... 90.9
  p95: ......................................................................... 159.2
  p99: ......................................................................... 257.3
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.4
  max: ......................................................................... 280.8
  median: ...................................................................... 102.5
  p95: ......................................................................... 172.5
  p99: ......................................................................... 267.8


--------------------------------------
Metrics for period to: 11:43:20(+0530) (width: 9.828s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 293
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 179
  median: ...................................................................... 85.6
  p95: ......................................................................... 138.4
  p99: ......................................................................... 162.4
http.responses: ................................................................ 293
vusers.completed: .............................................................. 293
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 23.9
  max: ......................................................................... 192.5
  median: ...................................................................... 96.6
  p95: ......................................................................... 149.9
  p99: ......................................................................... 179.5


--------------------------------------
Metrics for period to: 11:43:30(+0530) (width: 9.808s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 291
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 305
  median: ...................................................................... 79.1
  p95: ......................................................................... 186.8
  p99: ......................................................................... 247.2
http.responses: ................................................................ 291
vusers.completed: .............................................................. 291
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 24.5
  max: ......................................................................... 313.7
  median: ...................................................................... 89.1
  p95: ......................................................................... 198.4
  p99: ......................................................................... 273.2


--------------------------------------
Metrics for period to: 11:43:40(+0530) (width: 9.946s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 2
http.codes.200: ................................................................ 286
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 318
  median: ...................................................................... 80.6
  p95: ......................................................................... 172.5
  p99: ......................................................................... 290.1
http.responses: ................................................................ 286
vusers.completed: .............................................................. 286
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 2
vusers.session_length:
  min: ......................................................................... 24
  max: ......................................................................... 322.6
  median: ...................................................................... 90.9
  p95: ......................................................................... 179.5
  p99: ......................................................................... 301.9


--------------------------------------
Metrics for period to: 11:43:50(+0530) (width: 9.861s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 307
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 21
  max: ......................................................................... 489
  median: ...................................................................... 85.6
  p95: ......................................................................... 223.7
  p99: ......................................................................... 459.5
http.responses: ................................................................ 307
vusers.completed: .............................................................. 307
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 25.1
  max: ......................................................................... 499
  median: ...................................................................... 96.6
  p95: ......................................................................... 232.8
  p99: ......................................................................... 478.3


--------------------------------------
Metrics for period to: 11:44:00(+0530) (width: 9.871s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 288
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 21
  max: ......................................................................... 539
  median: ...................................................................... 94.6
  p95: ......................................................................... 290.1
  p99: ......................................................................... 424.2
http.responses: ................................................................ 288
vusers.completed: .............................................................. 288
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 26
  max: ......................................................................... 555
  median: ...................................................................... 104.6
  p95: ......................................................................... 295.9
  p99: ......................................................................... 432.7


--------------------------------------
Metrics for period to: 11:44:10(+0530) (width: 9.931s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 296
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 561
  median: ...................................................................... 85.6
  p95: ......................................................................... 327.1
  p99: ......................................................................... 518.1
http.responses: ................................................................ 296
vusers.completed: .............................................................. 296
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 22.4
  max: ......................................................................... 573.8
  median: ...................................................................... 96.6
  p95: ......................................................................... 340.4
  p99: ......................................................................... 528.6


--------------------------------------
Metrics for period to: 11:44:20(+0530) (width: 9.852s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 293
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 20
  max: ......................................................................... 226
  median: ...................................................................... 82.3
  p95: ......................................................................... 183.1
  p99: ......................................................................... 214.9
http.responses: ................................................................ 293
vusers.completed: .............................................................. 293
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 22.9
  max: ......................................................................... 261
  median: ...................................................................... 92.8
  p95: ......................................................................... 194.4
  p99: ......................................................................... 228.2


Phase completed: Warm up (index: 0, duration: 100s) 11:44:36(+0530)

--------------------------------------
Metrics for period to: 11:44:30(+0530) (width: 9.995s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 2
http.codes.200: ................................................................ 295
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 21
  max: ......................................................................... 156
  median: ...................................................................... 77.5
  p95: ......................................................................... 130.3
  p99: ......................................................................... 144
http.responses: ................................................................ 295
vusers.completed: .............................................................. 295
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 2
vusers.session_length:
  min: ......................................................................... 24.6
  max: ......................................................................... 187.2
  median: ...................................................................... 85.6
  p95: ......................................................................... 149.9
  p99: ......................................................................... 165.7


--------------------------------------
Metrics for period to: 11:44:40(+0530) (width: 6.258s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
http.codes.200: ................................................................ 185
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 187
http.response_time:
  min: ......................................................................... 29
  max: ......................................................................... 249
  median: ...................................................................... 87.4
  p95: ......................................................................... 175.9
  p99: ......................................................................... 214.9
http.responses: ................................................................ 185
vusers.completed: .............................................................. 185
vusers.created: ................................................................ 187
vusers.created_by_name.0: ...................................................... 187
vusers.failed: ................................................................. 7
vusers.session_length:
  min: ......................................................................... 36.1
  max: ......................................................................... 255.3
  median: ...................................................................... 98.5
  p95: ......................................................................... 186.8
  p99: ......................................................................... 223.7


--------------------------------------
Metrics for period to: 11:44:50(+0530) (width: 0.266s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 7
vusers.failed: ................................................................. 7


All VUs finished. Total time: 1 minute, 51 seconds

--------------------------------
Summary report @ 11:44:45(+0530)
--------------------------------

errors.ETIMEDOUT: .............................................................. 60
http.codes.200: ................................................................ 2940
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 3000
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 583
  median: ...................................................................... 87.4
  p95: ......................................................................... 210.6
  p99: ......................................................................... 383.8
http.responses: ................................................................ 2940
vusers.completed: .............................................................. 2940
vusers.created: ................................................................ 3000
vusers.created_by_name.0: ...................................................... 3000
vusers.failed: ................................................................. 60
vusers.session_length:
  min: ......................................................................... 20.4
  max: ......................................................................... 597.8
  median: ...................................................................... 96.6
  p95: ......................................................................... 223.7
  p99: ......................................................................... 391.6